Tekla Open API Reference for Tekla Structures 2025
ShapeItem.ShapeFacetedBrep Property
 The data structure containing the geometric information of the shape as a FacetedBRep
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public FacetedBrep ShapeFacetedBrep { get; set; }
Public Property ShapeFacetedBrep As FacetedBrep
	Get
	Set
Property Value
Type: FacetedBrep
See Also
Reference
ShapeItem Class
Tekla.Structures.Catalogs Namespace